; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?o1 ?o2)
	       (ontable ?o1)
	       (clear ?o1)
	       (handempty)
	       (holding ?o1)
	       )

  (:action pick-up
	     :parameters (?o1)
	     :precondition (and (clear ?o1) (ontable ?o1) (handempty))
	     :effect
	     (and (not (ontable ?o1))
		   (not (clear ?o1))
		   (not (handempty))
		   (holding ?o1)))

  (:action put-down
	     :parameters (?o1)
	     :precondition (and (holding ?o1))
	     :effect
	     (and (not (holding ?o1))
		   (clear ?o1)
		   (handempty)
		   (ontable ?o1)))
  (:action stack
	     :parameters (?o1 ?o2)
	     :precondition (and (holding ?o1) (clear ?o2))
	     :effect
	     (and (not (holding ?o1))
		   (not (clear ?o2))
		   (clear ?o1)
		   (handempty)
		   (on ?o1 ?o2)))
  (:action unstack
	     :parameters (?o1 ?o2)
	     :precondition (and (on ?o1 ?o2) (clear ?o1) (handempty))
	     :effect
	     (and (holding ?o1)
		   (clear ?o2)
		   (not (clear ?o1))
		   (not (handempty))
		   (not (on ?o1 ?o2)))))

; problem
(define (problem test-4-2)
(:domain blocks)
(:objects D C B A - object)
(:init (holding D) (ontable A) (on B A) (on C B) (clear C)	
       )       
(:goal (AND
	   (handempty)
	   (not (holding A))
	   (not (holding B))
	   (not (holding C))
	   (not (holding D))

       	   (ontable A)
           (ontable B)
           (ontable C)
           (ontable D)

	   (clear A)
	   (clear B)
	   (clear C)
	   (clear D)

           (not (on A A))
           (not (on A B))
           (not (on A C))
           (not (on A D))

           (not (on B A))
           (not (on B B))
           (not (on B C))
           (not (on B D))

	   (not (on C A))
	   (not (on C B))
	   (not (on C C))	   	   
	   (not (on C D))

	   (not (on D A))
	   (not (on D B))
	   (not (on D C))
	   (not (on D D))	  
)))

; plan
1. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 23 of 29
2. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holding c) (clear b)
   goals met: 22 of 29
3. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 26 of 29
4. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 25 of 29
5. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 29 of 29
